workspace/poc/.metadata/.plugins/org.eclipse.core.resources/.history/11/a0072ca74a4a001e13ee9a6792c86d17

<?xml version="1.0" encoding="UTF-8"?>
<api context="/BSCS/GenericApi" name="BSCS_Sample_Dynamic_API" xmlns="http://ws.apache.org/ns/synapse">
    <resource methods="POST GET">
        <inSequence>
            <property description="cust_id" expression="json-eval($.customer_id)" name="cust_id" scope="default" type="STRING"/>
            <log level="custom">
                <property expression="json-eval($ctx:cust_id)" name="cust_id"/>
            </log>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:cus="http://ericsson.com/services/ws_CIL_7/customerread" xmlns:ses="http://ericsson.com/services/ws_CIL_7/sessionchange" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                        <soapenv:Header>
                            <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                                <wsse:UsernameToken wsu:Id="UsernameToken-05E5B20EFB7524EEE216852580645311">
                                    <wsse:Username>$1</wsse:Username>
                                    <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">$2</wsse:Password>
                                </wsse:UsernameToken>
                            </wsse:Security>
                        </soapenv:Header>
                        <soapenv:Body>
                            <cus:customerReadRequest>
                                <!--You may enter the following 2 items in any order -->
                                <!--Optional: -->
                                <cus:inputAttributes>
                                    <!--You may enter the following 3 items in any order -->
                                    <!--Optional: -->
                                    <cus:csId>$3</cus:csId>
                                    <!--Optional: -->
                                    <!-- <cus:csIdPub>?</cus:csIdPub> -->
                                    <!--Optional: -->
                                    <!-- <cus:syncWithDb>?</cus:syncWithDb> -->
                                </cus:inputAttributes>
                                <!--Optional: -->
                                <cus:sessionChangeRequest>
                                    <!--Optional: -->
                                    <ses:values>
                                        <!--1 or more repetitions: -->
                                        <ses:item>
                                            <!--You may enter the following 2 items in any order -->
                                            <ses:key>BU_ID</ses:key>
                                            <ses:value>2</ses:value>
                                        </ses:item>
                                    </ses:values>
                                </cus:sessionChangeRequest>
                            </cus:customerReadRequest>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="get-property('file','wsdlUser')"/>
                    <arg evaluator="xml" expression="get-property('file','wsdlPwd')"/>
                    <arg evaluator="json" expression="$ctx:cust_id"/>
                </args>
            </payloadFactory>
            <header name="Action" scope="default" value="urn:customerRead"/>
            <call>
                <endpoint>
                    <address format="soap11" uri="$FILE:BSCSKnotServerURL">
                        <suspendOnFailure>
                            <initialDuration>-1</initialDuration>
                            <progressionFactor>-1</progressionFactor>
                            <maximumDuration>0</maximumDuration>
                        </suspendOnFailure>
                        <markForSuspension>
                            <retriesBeforeSuspension>0</retriesBeforeSuspension>
                        </markForSuspension>
                    </address>
                </endpoint>
            </call>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <enrich description="cutomer_read_response">
                <source clone="true" type="body"/>
                <target property="customer_read_response" type="property"/>
            </enrich>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:add="http://ericsson.com/services/ws_CIL_7/addressread" xmlns:ses="http://ericsson.com/services/ws_CIL_7/sessionchange" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                        <soapenv:Header>
                            <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                                <wsse:UsernameToken wsu:Id="UsernameToken-4041E3749487CEEDA416735096455611">
                                    <wsse:Username>$1</wsse:Username>
                                    <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">$2</wsse:Password>
                                    <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">qGELBcPOuTVG3N9euZozew==</wsse:Nonce>
                                    <wsu:Created>2023-01-12T07:47:25.554Z</wsu:Created>
                                </wsse:UsernameToken>
                            </wsse:Security>
                        </soapenv:Header>
                        <soapenv:Body>
                            <add:addressReadRequest>
                                <!--You may enter the following 2 items in any order-->
                                <!--Optional:-->
                                <add:inputAttributes>
                                    <!--You may enter the following 3 items in any order-->
                                    <!--Optional:-->
                                    <add:adrType/>
                                    <!--Optional:-->
                                    <add:csId>$3</add:csId>
                                    <!--Optional:-->
                                    <add:csIdPub/>
                                </add:inputAttributes>
                                <!--Optional:-->
                                <add:sessionChangeRequest>
                                    <!--Optional:-->
                                    <ses:values>
                                        <!--1 or more repetitions:-->
                                        <ses:item>
                                            <!--You may enter the following 2 items in any order-->
                                            <ses:key>BU_ID</ses:key>
                                            <ses:value>2</ses:value>
                                        </ses:item>
                                    </ses:values>
                                </add:sessionChangeRequest>
                            </add:addressReadRequest>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="get-property('file','wsdlUser')"/>
                    <arg evaluator="xml" expression="get-property('file','wsdlPwd')"/>
                    <arg evaluator="xml" expression="$ctx:cust_id"/>
                </args>
            </payloadFactory>
            <header name="Action" scope="default" value="urn:addressRead"/>
            <call>
                <endpoint>
                    <address format="soap11" uri="$FILE:BSCSKnotServerURL">
                        <suspendOnFailure>
                            <initialDuration>-1</initialDuration>
                            <progressionFactor>-1</progressionFactor>
                            <maximumDuration>0</maximumDuration>
                        </suspendOnFailure>
                        <markForSuspension>
                            <retriesBeforeSuspension>0</retriesBeforeSuspension>
                        </markForSuspension>
                    </address>
                </endpoint>
            </call>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <enrich description="address_read_response">
                <source clone="true" type="body"/>
                <target property="address_read_response" type="property"/>
            </enrich>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:con="http://ericsson.com/services/ws_CIL_7/contractssearch" xmlns:ses="http://ericsson.com/services/ws_CIL_7/sessionchange" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                        <soapenv:Header>
                            <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                                <wsse:UsernameToken wsu:Id="UsernameToken-4041E3749487CEEDA416735096455611">
                                    <wsse:Username>$1</wsse:Username>
                                    <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">$2</wsse:Password>
                                    <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">qGELBcPOuTVG3N9euZozew==</wsse:Nonce>
                                    <wsu:Created>2023-01-12T07:47:25.554Z</wsu:Created>
                                </wsse:UsernameToken>
                            </wsse:Security>
                        </soapenv:Header>
                        <soapenv:Body>
                            <con:contractsSearchRequest>
                                <!--You may enter the following 2 items in any order -->
                                <!--Optional: -->
                                <con:inputAttributes>
                                    <!--You may enter the following 91 items in any order -->
                                    <!--Optional: -->
                                    <!--Optional: -->
                                    <con:csId>$3</con:csId>
                                    <!--Optional: -->
                                </con:inputAttributes>
                                <!--Optional: -->
                                <con:sessionChangeRequest>
                                    <!--Optional: -->
                                    <ses:values>
                                        <!--1 or more repetitions: -->
                                        <ses:item>
                                            <!--You may enter the following 2 items in any order -->
                                            <ses:key>BU_ID</ses:key>
                                            <ses:value>2</ses:value>
                                        </ses:item>
                                    </ses:values>
                                </con:sessionChangeRequest>
                            </con:contractsSearchRequest>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="get-property('file','wsdlUser')"/>
                    <arg evaluator="xml" expression="get-property('file','wsdlPwd')"/>
                    <arg evaluator="json" expression="$ctx:cust_id"/>
                </args>
            </payloadFactory>
            <header name="Action" scope="default" value="urn:contractsSearch"/>
            <call>
                <endpoint>
                    <address format="soap11" uri="$FILE:BSCSKnotServerURL">
                        <suspendOnFailure>
                            <initialDuration>-1</initialDuration>
                            <progressionFactor>-1</progressionFactor>
                            <maximumDuration>0</maximumDuration>
                        </suspendOnFailure>
                        <markForSuspension>
                            <retriesBeforeSuspension>0</retriesBeforeSuspension>
                        </markForSuspension>
                    </address>
                </endpoint>
            </call>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <enrich description="cutomer_read_response">
                <source clone="true" type="body"/>
                <target property="contracts_read_response" type="property"/>
            </enrich>
            <payloadFactory media-type="json">
                <format>{&#xd;
"customer_read_response":$1,&#xd;
"address_read_response":$2,&#xd;
"contracts_read_response":$3&#xd;
}</format>
                <args>
                    <arg evaluator="xml" expression="$ctx:customer_read_response"/>
                    <arg evaluator="xml" expression="$ctx:address_read_response"/>
                    <arg evaluator="xml" expression="$ctx:contracts_read_response"/>
                </args>
            </payloadFactory>
            <respond/>
        </inSequence>
        <outSequence/>
        <faultSequence/>
    </resource>
</api>
